tutorials/Accuracy/conjugateHeatFoam/caseA-dt=0.005s/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    topWall
    {
        type            patch;
        nFaces          80;
        startFace       12640;
    }
    left
    {
        type            patch;
        nFaces          80;
        startFace       12720;
    }
    right
    {
        type            regionCouple;
        nFaces          80;
        startFace       12800;
        shadowRegion    solid;
        shadowPatch     left;
        zone            rightZone;
        attached        off;
        master          on;
        isWall          on;
        bridgeOverlap   off;
    }
    bottomWall
    {
        type            wall;
        nFaces          80;
        startFace       12880;
    }
    frontAndBack
    {
        type            empty;
        nFaces          12800;
        startFace       12960;
    }
)


// ************************************************************************* //
